// 2020년 1학기
// 기초, 인간학, 2, A0
// 기초, 키스톤디자인탐구소통,2, A0
// 기초, 생애진로와커리어디자인,1,Pass
// 중핵, 설화와애니메이션, 3,A+
// 중핵, 미지어의발전과문화,3,A+
// 전기, 컴퓨터와프로그래밍1,3,A+
// 전기,디지털콘텐츠창작입문,3,A+

// 2020년 2학기
// 기초, 키스톤디자인창의설계,2,A+
// 기초, 인간학2,2,A+
// 중핵, 우연의과학:통계학,3,B+
// 중핵,음식윤리,3,A0
// 중핵,기업가정신과기술창업,3,A+
// 중핵,신화적상상력과게임미디어,3,A+
// 전기,컴퓨터와프로그래밍2,3,A+

// 2021년 1학기
// 기초,그리스도교사상과문화,2,B+
// 전기,일반물리학및실험1,3,A0
// 전기,일반수학1및연습,3,B+
// 전선1,선형대수학,3,A+
// 전선1,자료구조기초,3,B0
// 전선2,디지털스토리텔링입문,3,B+

// 2021년 2학기
// 기초 사랑나누기,2,Pass
// 전선1,웹프로그래밍,3,A+
// 전선1,시스템소프트웨어실습,3,A+
// 전선2,3D애니메이션2,3,A+
// 전선2,객체지향프로그래밍,3,A+
// 전선2,컴퓨터그래픽스,3,A+

// 2022년 1학기
// 전선1, 논리회로및설계,3,B+
// 전선1,운영체제,3,B+
// 전선1,자료구조,3,A+
// 전선1,웹서비스컴퓨팅,3,B+
// 전선2,데이터구조개론및응용,3,A+
// 전선2,디지털미디어공학개론,3,A+

// 교환학생
// 자교 14학점

// 2023년 2학기
// 전기, 일반수학2및연습,3,A0
// 전선1,문제해결기법,3,C+
// 전선1,컴퓨터구조,3,B+
// 전선1,데이터베이스설계,3,C+
// 전선1,컴퓨터네트워크,3,B+

// 동계 계절학기
// 전기,미디어정보처리프로그래밍,3,A+

// 2024년 1학기
// 전선2,게임프로그래밍,3,A+
// 전선2,ICTHW/SW융합서비스캡스톤디자인,3,A+
// 전선2,문화경영의실습,3,C+
// 전선2,컴퓨터애니메이션,3,A+
// 전선2,콘텐츠마케팅,3,B+
// 전선2,기계학습입문,3,A+


// 전체 이수학점: 138학점

// 전공(전선1) 이수학점: 36학점
// 전공(전선1) 평점: 3.63

// 부전공(전선2) 이수학점: 36학점
// 부전공(전선2) 평점: 4.17
